
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/16412291137)


<pre><code>Plan: 1 to import, 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.test_cwlogs1.aws_cloudwatch_log_group.this
* Update
  * aws_cloudwatch_log_group.test_cwlogs1
* Import
  * aws_cloudwatch_log_group.test_cwlogs1


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.test_cwlogs1 will be updated in-place
  # (imported from "test-cwlogs1")
  ~ resource "aws_cloudwatch_log_group" "test_cwlogs1" {
        arn               = "arn:aws:logs:ap-northeast-1:644370126241:log-group:test-cwlogs1"
        id                = "test-cwlogs1"
        kms_key_id        = null
        log_group_class   = "STANDARD"
        name              = "test-cwlogs1"
        name_prefix       = null
        region            = "ap-northeast-1"
      ~ retention_in_days = 30 -> 0
        skip_destroy      = false
        tags              = {}
        tags_all          = {
            "Env"                = "prd"
            "ManagedByTerraform" = "true"
        }
    }

  # module.test_cwlogs1.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-cwlogs1"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

Plan: 1 to import, 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"11d9ea9f649599af0a682e4eca8469361ad1d02b","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->